tests/Functional/Resources/Subscriptions/_fixtures/response/full_entity.json

{
  "data": {
    "id": "sub_01hp463gxfvndqjjyqn2n7tkth",
    "status": "active",
    "customer_id": "ctm_01hp462x4578nc20acj9g956yy",
    "address_id": "add_01hp462x4jrb91ya7ee01pd0mf",
    "business_id": null,
    "currency_code": "USD",
    "created_at": "2024-02-08T11:02:04.975Z",
    "updated_at": "2024-02-08T11:02:04.975Z",
    "started_at": "2024-02-08T11:02:03.946454Z",
    "first_billed_at": "2024-02-08T11:02:03.946454Z",
    "next_billed_at": "2024-03-08T11:02:03.946454Z",
    "paused_at": null,
    "canceled_at": null,
    "collection_mode": "automatic",
    "billing_details": null,
    "current_billing_period": {
      "starts_at": "2024-02-08T11:02:03.946454Z",
      "ends_at": "2024-03-08T11:02:03.946454Z"
    },
    "billing_cycle": {
      "frequency": 1,
      "interval": "month"
    },
    "scheduled_change": null,
    "items": [
      {
        "status": "active",
        "quantity": 10,
        "recurring": true,
        "created_at": "2024-02-08T11:02:04.975Z",
        "updated_at": "2024-02-08T11:02:04.975Z",
        "previously_billed_at": "2024-02-08T11:02:03.946454Z",
        "next_billed_at": "2024-03-08T11:02:03.946454Z",
        "trial_dates": null,
        "price": {
          "id": "pri_01gsz8x8sawmvhz1pv30nge1ke",
          "product_id": "pro_01gsz4t5hdjse780zja8vvr7jg",
          "type": "standard",
          "description": "Monthly (per seat)",
          "name": "Monthly (per seat)",
          "tax_mode": "account_setting",
          "billing_cycle": {
            "frequency": 1,
            "interval": "month"
          },
          "trial_period": null,
          "unit_price": {
            "amount": "3000",
            "currency_code": "USD"
          },
          "unit_price_overrides": [],
          "custom_data": {
            "features": {
              "crm": true,
              "data_retention": false,
              "reports": true
            },
            "suggested_addons": [
              "pro_01h1vjes1y163xfj1rh1tkfb65",
              "pro_01gsz97mq9pa4fkyy0wqenepkz"
            ],
            "upgrade_description": "Move from Basic to Pro to take advantage of advanced reporting and a CRM that's right where you're chatting."
          },
          "status": "active",
          "quantity": {
            "minimum": 1,
            "maximum": 999
          },
          "import_meta": null,
          "created_at": "2023-02-23T13:55:22.538367Z",
          "updated_at": "2023-11-09T14:07:16.051528Z"
        },
        "product": {
          "id": "pro_01gsz4t5hdjse780zja8vvr7jg",
          "name": "ChatApp Pro",
          "description": "Everything in basic, plus access to a suite of powerful tools and features designed to take your team's productivity to the next level.",
          "tax_category": "standard",
          "image_url": "https://paddle-sandbox.s3.amazonaws.com/user/10889/2nmP8MQSret0aWeDemRw_icon1.png",
          "status": "active",
          "created_at": "2023-08-16T14:38:08.3Z",
          "updated_at": "2023-08-16T14:38:08.3Z"
        }
      },
      {
        "status": "active",
        "quantity": 1,
        "recurring": true,
        "created_at": "2024-02-08T11:02:04.975Z",
        "updated_at": "2024-02-08T11:02:04.975Z",
        "previously_billed_at": "2024-02-08T11:02:03.946454Z",
        "next_billed_at": "2024-03-08T11:02:03.946454Z",
        "trial_dates": null,
        "price": {
          "id": "pri_01h1vjfevh5etwq3rb416a23h2",
          "product_id": "pro_01h1vjes1y163xfj1rh1tkfb65",
          "type": "standard",
          "description": "Monthly (recurring addon)",
          "name": null,
          "tax_mode": "account_setting",
          "billing_cycle": {
            "frequency": 1,
            "interval": "month"
          },
          "trial_period": null,
          "unit_price": {
            "amount": "10000",
            "currency_code": "USD"
          },
          "unit_price_overrides": [],
          "custom_data": null,
          "status": "active",
          "quantity": {
            "minimum": 1,
            "maximum": 100
          },
          "import_meta": null,
          "created_at": "2023-06-01T13:31:12.625056Z",
          "updated_at": "2023-08-30T10:34:33.862679Z"
        },
        "product": {
          "id": "pro_01gsz4t5hdjse780zja8vvr7jg",
          "name": "ChatApp Pro",
          "description": "Everything in basic, plus access to a suite of powerful tools and features designed to take your team's productivity to the next level.",
          "tax_category": "standard",
          "image_url": "https://paddle-sandbox.s3.amazonaws.com/user/10889/2nmP8MQSret0aWeDemRw_icon1.png",
          "status": "active",
          "created_at": "2023-08-16T14:38:08.3Z",
          "updated_at": "2023-08-16T14:38:08.3Z"
        }
      }
    ],
    "custom_data": null,
    "management_urls": {
      "update_payment_method": "https://buyer-portal.paddle.com/subscriptions/sub_01hp463gxfvndqjjyqn2n7tkth/update-payment-method",
      "cancel": "https://buyer-portal.paddle.com/subscriptions/sub_01hp463gxfvndqjjyqn2n7tkth/cancel"
    },
    "discount": null,
    "import_meta": null
  },
  "meta": {
    "request_id": "b6752f6a-acbf-445c-8eb5-2cbb80b7a8e5"
  }
}
